["@mondoweiss It was a bad moment, I agree. But from what I could see, it looked like about half the people were Biden groupies, not necessarily from the church congregation.", "The Biden administration is hitting the pause button on new projects involving the export of natural gas. While the U.S. is currently the largest exporter of natural gas in the world, the White House argues the climate effects of these projects are too great to ignore. Coral Davenport, who covers energy and environmental policy for […] … https://factline.org/white-house-halts-major-liquid-natural-gas-project-and-new-exports-over-climate-concerns/", "The White House says President Biden is considering options to strike back against the Iran-backed militia that killed three American soldiers on Sunday in Jordan. In Yemen, Iraq, Syria and now Jordan, American forces are engaging Iranian-supported groups. Nick Schifrin joins Geoff Bennett to discuss the escalations, the U.S. response and new developments in Gaza. […] … https://factline.org/biden-vows-to-respond-to-drone-attack-on-u-s-base-in-jordan/", "The deal had been in the works for months and seemed to be nearing completion in the Senate before it began to fall apart, largely because Republican presidential front-runner Donald Trump doesn’t want it to happen. Read More PBS NewsHour – The Latest … https://factline.org/president-biden-says-hell-shut-the-u-s-mexico-border-if-given-the-ability-what-does-that-mean/", "Why is Joe Biden claiming he'll shut down the U.S.-Mexico border?President Joe Biden has made some strong claims over the past few days about shutting down the U.S.-Mexico border as he tries to salvage a border deal in Congress that would also unlock money for Ukraine.#cbc #news #News #World https://www.cbc.ca/news/world/us-biden-border-deal-explained-1.7098338?cmp=rss", "@GreenFire @igd_news Sometimes I wonder if GOP members themselves are in on encouraging third world migrants through their homeland's top media platforms. ANYTHING to make Biden look bad.", "Why is Joe Biden claiming he'll shut down the U.S.-Mexico border? https://www.cbc.ca/news/world/us-biden-border-deal-explained-1.7098338?cmp=rss", "CNN Host TRIGGERS Republican, Shuts Down MAGA LIES to His Face! - https://youtu.be/L69HHlxWN-k?si=P8gRx6cHuuRb4-Zn #USForces #politics #biden #trump #maga #republican #cnn #dronestrike #drone #jordan #usmilitary #war #military #PonderingPolitics", "1) I actually am voting, fool, for Claudia De la Cruz, the Party for Liberation and Socialism candidate. 2) I'm not a Democrat & have not been for the past 40 years; I am not obligated to vote for your party based on any of your threats or promises. 3) You can't vote in fascism if you don't vote for fascists. Biden is the creeping fascist here; Trumpster is the galloping one. Not voting for either one.SYAD and keep your own ass outta my voting booth. And, here's a BAHLOCK to help you. #Bye", "<Nim>National Progressivism Excuse me Biden fans what did you just call it", "Not only is the border chaos the only issue republicans have, it may also be the only thing that keeps them from being embarrassed in #Texas. It’ll be abortion rights vs. border chaos. Biden’s already invited Kate Cox to the SOTU and I’m sure republicans will bring a widow of a person killed by an illegal immigrant.", "I think the Biden camp wanted to avoid the mental fit age fight but it seems to really irk Trump. The general public knows biden is old but the media is only now starting to pay closer attention to trumps lapses. The Biden camp is more than happy to have Trump have several more campaigns stops where all he does is ramble about being able to identify a whale.   #Election2024 #Politics #uspol", "Daily \"Probabilistic Views\" Summary:281.0 days until polls start to closeOdds with Independent States:Trump: 98.5% (was 99.0% a week ago)Tie: 0.3% (was 0.2% a week ago)Biden: 1.2% (was 0.9% a week ago)Odds with Uniform Swing:Trump: 95.6% (was 95.6% a week ago)Tie: 0.0% (was 0.0% a week ago)Biden: 4.4% (was 4.4% a week ago)This is a nowcast, not a forecast!More info here: https://electiongraphs.com/2024ec/#USPol #Election2024 #Biden #Trump", "As much the general public is tired of Joe Biden, I still think the public is even more tired of Donald Trump. #Election2024 #Politics #uspol", "Daily \"Categorization View\" Summary:281.0 days until polls start to closeTrump Best: Trump by 134(Was Trump by 134 a week ago)Expected: Trump by 50(Was Trump by 88 a week ago)Biden Best: Biden by 16(Was Biden by 16 a week ago)Tipping point: Trump ahead by 4.0% in MI(Was Trump ahead by 4.0% in MI a week ago)This is a nowcast, not a forecast!More info here: https://electiongraphs.com/2024ec/#USPol #Election2024 #Biden #Trump", "Getötete US-Soldaten in Jordanien: Wird Biden den Iran angreifen?Auf Militärbasis kamen bei einem Drohnenangriff drei GIs ums Leben. Biden kündigt harte Reaktion an, Kriegs-Hardliner wollen Schlag gegen Iran. Eskalationsstufe Rot. https://www.heise.de/tp/features/Getoetete-US-Soldaten-in-Jordanien-Wird-Biden-den-Iran-angreifen-9612265.html?wt_mc=sm.red.ho.mastodon.mastodon.md_beitraege.md_beitraege#news", "Joe Biden droht mit Vergeltung: Drei US-Soldaten bei Drohnenangriff in Jordanien getötet – WELT https://my24group.com/joe-biden-droht-mit-vergeltung-drei-us-soldaten-bei-drohnenangriff-in-jordanien-getotet-welt/ Joe Biden droht mit Vergeltung: Drei US-Soldaten bei Drohnenangriff in Jordanien getötet  WELTIran: Drohnen…", "The basic irony of some trans liberals that \"Well, less genocide is better than more, so if voting for Biden and rationalizing away Palestinians and other marginalized folk means more trans folk are saved, well better hold our noses and vote for the \"less genocidal Democrat!!\"No. Absolutely NOT. NO Genocide is better than even a little.And, Democrats have no intention of either stopping the Palestinian genocide NOR even lifting a finger to prevent or slow down the antitrans onslaught.", "👍 Biden administration announces steps to prohibit use of salary history for federal employees, contractors | The Hillhttps://thehill.com/homenews/administration/4434673-biden-administration-announces-steps-to-prohibit-use-of-salary-history-for-federal-employees-contractors/", "Awwww...... Michigan #GOP turmoil threatens effort to flip state for #Trump | The Hillhttps://thehill.com/homenews/campaign/4435973-michigan-gop-kristina-karamo-joe-biden-donald-trump-2024/", "This rabbit-hole largely brought to you by https://newrepublic.com/article/178382/joe-biden-running-roe-its-not-enough", "Today in \"distracting and disturbing US recent history\": trying to look up the Comstock Act's 1994 penalty increases in the huge \"Clinton crime bill\", and instead finding that Biden (amongst other Democratic senators) voted for H.R.1833, the so-called \"Partial Birth Abortion Act\", after it was vetoed (thankfully it did not quite pass).", "@timmy How does Biden think he's not going to alienate large chunks of his base? These are not the statements of a politically aware man. Surely he's got some advisors telling him to tone it down a notch or something?It's at the point where I'm daily seeing people calling him \"Genocide Joe\" online for his ongoing, unequivocal support of what Israel is doing to the Palestinians. Nobody with half a brain sees this as a targeted hunt for Hamas anymore.", "As the standoff between the state and federal government on Texas’ southern border escalates, advocacy groups are joining Democrats in a call for the Biden administration to act more forcefully.https://www.houstonpublicmedia.org/articles/news/border/2024/01/29/475753/as-border-standoff-between-texas-and-feds-grows-so-does-concern-over-possible-violence/#Border #Immigration #News #Texas #ConcertinaWires #GovGregAbbott #TexasBorder", "From 29 Jan: GOP Senator Punished By His Own Party for Doing His Job on Border Deal - The Republican senator who led efforts to negotiate with the Biden administration on a border deal w... https://www.thedailybeast.com/gop-senator-punished-by-own-party-for-doing-his-job-on-border-deal #politics", "Be careful folks. Vet everything, especially everything political this year, to make sure it is real before running with it or getting upset by it. Pictures, video, robocalls, stories, this year will be full of more bullshit than ever.https://www.pcmag.com/news/ai-powered-deepfake-biden-robocall-traced-back-to-elevenlabs", "Commonwealth LNG project delayed due to US export approval pause - published 29 Jan 2024 #News #Startups #ASX #Biden #Investment https://grafa.com/news/commonwealth-lng-project-delayed-due-to-us-export-approval-pause-175339", "Nach dem tödlichen Drohnenangriff auf einen US-Stützpunkt am Sonntag in Jordanien wollen die USA nach den Worten von Präsident Joe Biden „alle Verantwortlichen zur Rechenschaft ziehen, zu einem Zeitpunkt und in einer Weise, die wir wählen“. Wie die US-Reaktion auf die womöglich ersten im Zusammenhang mit dem Hamas-Terrorangriff und Gaza-Krieg stehenden (…) https://orf.at/stories/3347098/#_Politik #_Ausland #_Biden #_Drohnenangriff #_Gaza #_Hamas #_Jordanien #_Krieg #_Terrorangriff #_US #_USA", "The US stock market is booming thanks to TFG. Even though he has lost his office 3 years ago and Biden is the president for 3 years now, the prospect of TFG returning to presidency is fueling the stock market.Everything else is horrible at the US thanks to Biden. Even though there is a prospect that TFG will return to the presidency, this prospect alone cannot make anything better since Biden has been president for 3 years now and TFG has lost the presidency 3 years ago.", "The fun never ends. On our latest FOIA lawsuit.https://www.ocregister.com/2024/01/29/the-biden-administration-is-protecting-trump-directed-surveillance-records-why/#foia #Trump #Biden #surveillance #blacklivesmatter #2020election #protest #firstamendment", "Iran: Drohnenangriff tötet US-Soldaten in Jordanien – Biden will Vergeltung – t-online https://my24group.com/iran-drohnenangriff-totet-us-soldaten-in-jordanien-biden-will-vergeltung-t-online/ Iran: Drohnenangriff tötet US-Soldaten in Jordanien – Biden will Vergeltung  t-onlineNach Tötung…", "@Slyence the madness is Republicans calling Biden weak when they are the ones literally stopping any action and opposing everything that we could possibly do", "Trump calls UAW president a 'dope' after union endorses Biden https://my24group.com/trump-calls-uaw-president-a-dope-after-union-endorses-biden/ Labor “Get rid of this dope & vote for DJT,” Trump said on Truth Social. Former President Donald Trump motions before …", "En Usono, la plej danĝera elektado\"En la sinsekvo de antaŭelektoj de la #usona prezidantelekta kampanjo en 2024, #SudaKarolino altiros ĉies okulojn en Februaro. Sur la #Demokrata flanko, prezidanto Joseph #Biden ŝajne nepre venkos ; sur la #Respublikana flanko, voĉdonantoj en ĉi tiu konservativa subŝtato probable sigelos la sorton de la rivaloj de Donald #Trump. La sola, sed pli ĝenerala, problemo : plimulto de #usonanoj deziras neniun el ili ...\"https://eo.mondediplo.com/2024/01/article3163.html#esperanto #usono", "If I have not made it clear, I dislike both, Donald Trump and Joe Biden, equally, and will not be supporting either. You want my vote?Find someone better than either one of these idiots.", "Nach Angriff in Jordanien: Wie werden die USA reagieren? https://my24group.com/nach-angriff-in-jordanien-wie-werden-die-usa-reagieren/ US-Präsident Biden steht unter Druck: Dass die USA auf den tödlichen Angriff auf ihre Truppen reagieren werden, ist klar. …", "https://abc3340.com/news/nation-world/18-of-voters-more-likely-to-back-taylor-swift-endorsed-presidential-candidate-poll-shows-2024-election-voting-ballot-biden-trump-white-house-politics-travis-kelce-kansas-city-chiefs\"#TaylorSwift may influence the results of the 2024 #PresidentialElection with nearly 20% of voters saying they are \"likely\" to support a candidate endorsed by her.\" #USpol #Biden #Trump", "@vozercozer sleepy joe biden! 🤤🥱😴", "Not sure which is more hilarious: that a bunch of MAGA chunkheads have convinced themselves that the most popular entertainer on the planet is the arm candy in a relationship with a (gridiron) football player, that they believe that somehow she and Biden have rigged the Superbowl as the only possible way for her to get a message across, or that it means they will root for (snort guffaw) San Francisco as a result."]