["L’économie des États-Unis accélère grâce à l’aide publique Le #PIBdes États-Unis a progressé de 2,5% en 2023, déjouant les pronostics de récession, alors même que la zone euro fait du quasi-surplace. Une performance qui s’explique d’abord par le soutien de l’État. Par @RGodin › https://www.mediapart.fr/journal/economie-et-social/300124/l-economie-des-etats-unis-accelere-grace-l-aide-publique", "@evan Biden has already negotiated one ceasefire and is trying to negotiate another, including starting to withhold aid.https://www.nbcnews.com/politics/white-house/biden-administration-discussing-slowing-weaponry-deliveries-israel-pre-rcna136035", "@merileedkarr @MatWright @dave But it's a global phenomenon. It has nothing to do with anything specific to the American medical system. It has nothing to do with capitalism. It has nothing to do with politics. Biden has been as bad or worse than turmpThis is one reason for inaction: no gang of lying power-hungry wankers can claim \"This crisis proves my politics are true!\" with any credibility, and use that claim to gain partisan advantage, which is all anyone with or after power cares about", "We’re already in a civil war, will Biden do something about it? https://www.thenation.com/article/politics/texas-is-spoiling-for-a-civil-war/", "SOLDATS AMÉRICAINS TUÉS EN JORDANIELa réponse américaine se précise« Joe Biden a déclaré mardi que « oui », il avait décidé comment riposter après la mort de trois militaires américains, une réponse qui prendra probablement la forme de représailles « multiples ». »Aurélia END — Internationalhttps://www.lapresse.ca/international/etats-unis/2024-01-30/soldats-americains-tues-en-jordanie/la-reponse-americaine-se-precise.php?mfid=MzJiY2YwNzcxNTMzMzY5MGFjYjUxODRkNjNiNzlhMzM=", "We really needed this. But again, MAGAt whining and bullying made this administration back down. What I saw in a clip on OAN yesterday was horrific. Very threatening and violent. We are allowing Russian propaganda to be spewed out to millions of Amerikkkans. It matters. So infuriating.https://www.msnbc.com/the-reidout/reidout-blog/disinformation-governance-board-biden-rcna38873", "\"As articulated in the NCS, the Biden-Harris Administration is committed to long-term planning and collaboration with the open-source software community to achieve a more defensible and resilient digital ecosystem.\" #USPol #OpenSource #NationalCybersecurityStrategy #NCS #Bidenhttps://www.whitehouse.gov/oncd/briefing-room/2024/01/30/fact-sheet-biden-harris-administration-releases-end-of-year-report-on-open-source-software-security-initiative/", "🔴 #Biden 🇺🇸, presidente degli #USA, ha affermato alla #MSNBC di avere preso una decisione su come rispondere all'attacco al confine tra #Siria e #Giordania, che ha causato la morte di 3 soldati #US.- Ritiene l'#Iran responsabile dell'attacco?- Danno le armi.- Ma lo ritiene direttamente responsabile?- Avremo questa discussione.- Cosa dice sulle preoccupazioni del suo partito a proposito dell'escalation?- Vedremo.", "I'm glad that I can express myself here. New evidence about the Hunter Biden prosecution and shady shit done by a #DonTheCon installed Special Prosecutor (ridiculous move by DOJ) makes me furious. The excuses about \"it takes time\" to prosecute the plotters and planners don't cut it anymore. We don't have time. An insurrectionist is SOTH and is sabotaging all legislation. Put a standalone Ukraine bill up! Get aggressive FFS. Why does this guy have a harsher sentence than insurrectionists?", "Canada Pension Plan Pours $100M into Fracking, LNG, as Biden Puts Industry Under Microscopehttps://www.theenergymix.com/canada-pension-plan-pours-100m-into-fracking-lng-as-biden-puts-industry-under-the-microscope/?utm_source=The+Energy+Mix&utm_campaign=7accde94b4-TEM_RSS_EMAIL_CAMPAIGN&utm_medium=email&utm_term=0_dc146fb5ca-7accde94b4-509992341", "@samlitzinger … and why that is bad for Biden.", "…Despite the #fearmongering of some #politicians, #crime rates have not gone up. But trauma is proliferating.\u2029The #militarized response to #migration “is damaging everyone it touches,” said Valeria Wheeler, who runs the lone NGO in the county assisting #migrants after they are released from #federal custody. “I can’t believe how far this has gone.”#state #federal #Biden #GregAbbott #Constitution #immigration #law", "Bidenova vláda rozhodla, ako zareaguje na zabitie troch amerických vojakov. Povedú jej kroky k eskalácii napätia? Americký prezident Joe Biden v utorok uviedol, že už rozhodol o tom, ako budú Spojené štáty reagovať na dronový útok na amerických vojakov v Jordánsku s troma obeťami. https://www.ta3.com/clanok/922453/bidenova-vlada-rozhodla-ako-zareaguje-na-zabitie-troch-americkych-vojakov-povedu-jej-kroky-k-eskalacii-napatia", "Air Force One has landed at Palm Beach Int'l Airport for the first time since Inauguration Day 2021. I was on that final Trump flight: https://www.voanews.com/a/usa_us-politics_trump-flies-florida-biden-inaugurated/6200985.html", "États-Unis : Washington envisage des représailles \"multiples\" après la mort de trois soldats américains en Jordanie🗞️ Le Figaro - 🕐 30/01 18:19Interrogé sur la pelouse de la Maison-Blanche avant de rejoindre la Floride, le président américain a indiqué qu’il tenait l’Iran pour responsable de la frappe de drone en Jordanie.Joe Biden a déclaré mardi 30 janvier que «oui», il avait décidé comm... [3292 chars]🔗 https://www.lefigaro.fr/international/etats-unis-apres-la-mort-de-trois-soldats-americains-en-jordanie-biden-a-decide-comment-riposter-20240130#actu #news #presse #lefigaro", "US Congressman Ro Khanna Campaigns For Joe Biden In South Carolina https://my24group.com/us-congressman-ro-khanna-campaigns-for-joe-biden-in-south-carolina/ Ro Khanna is campaigning in favour of US President Joe Biden.Indian-American Congressman Ro Khanna is campaigning in favou…", "Enjoyed the truth of this last sentence in this article from the New Republic so much:“There was probably a lane for someone to do reasonably well against Biden,” tweeted Osita Nwanevu, a columnist for The Guardian and contributing editor for The New Republic, “but being maximally annoying to every constituency in the Democratic Party at once wasn’t it, obviously.”https://apple.news/A0rCrwWoTQaudK4kvICfr2g", "…It’s been nearly two years since #Abbott & other #Republican governors began traveling to this Democratic-voting Tejano city for news conferences denouncing “open borders” & unveiling plans to deploy #Texas #troops & drop river buoys. The #state’s #border w/ #Mexico is an #international boundary under the #jurisdiction of #federal authorities, but Abbott & his allies contend they have the right to intervene because the #Biden admin hasn’t done enough….#GregAbbott #Constitution #immigration", "Never make the mistake of thinking there's no difference. Not enough, maybe, but it would be as bad as thinking there's no difference between Biden and Trump...", "Unprecedented migration has made this #border county’s 74 miles of riverfront the scene of an unfolding #human & #constitutional drama. The huge number of #migrants who have crossed the river & the crackdown designed to stop that flow have attracted the attention of everyone from #ImmigrantRights activists to #racist #militias curious to see whether the #federal supremacy that withstood a civil war will survive once more.#Biden #GregAbbott #Constitution #immigration", "#Mexicans who cross legally make up ~½ of #EaglePass’s workforce; many US residents also cross the river to work. While local government & the school district have been Eagle Pass’s biggest employers historically, residents are increasingly landing jobs w/ the #Border Patrol & large manufacturers. Still, nearly a ¼ of the population — about 2X the #Texas avg — lives in #poverty.#state #federal #Biden #GregAbbott #Constitution #immigration #NationalGuard", "@podfeet @caseyliss That’s a pretty standard style guide rule. E.g., newspapers refer to President Biden the first time he is mentioned in the article, and Mr. Biden subsequently. So, it’s Apple Vision Pro the first time, and Mr. Vision henceforth.", "The feud between #Abbott & the #Biden admin is heating up just as the presidential #election campaign gets underway. The issue has galvanized #Republicans, some of whom are now questioning the merits of a #bipartisan #border package tied to #Ukraine #aid after #Trump called it “meaningless.” #POTUS Biden has been pushed to take a harsher stance — declaring Fri that he would “shut down” the southern border when illegal crossings surge.#state #federal #immigration #NationalGuard #GregAbbott", "AI companies will need to report their safety tests to the US government https://apnews.com/article/biden-ai-artificial-intelligence-safe-395591bcde523416db88767fa54f30f5", "#SCOTUS has ordered #Abbott to allow #Border Patrol agents to remove or cut wire to reach the river & aid #migrants in distress. Abbott’s troops are installing even more wire. 25 #Republican governors recently signed a letter expressing their support for Abbott’s #rebellion, & #Trump is calling on states to join the standoff.#state #federal #Biden #SCOTUS #immigration #EaglePass #NationalGuard #GregAbbott #RazorWire", "🙄”Chinese leader #Xi Jinping told US President Joe #Biden that #China would not interfere in the 2024 US presidential election when the two men met in November — an assurance reiterated by the Chinese foreign minister to Biden’s national security adviser this past weekend”https://www.cnn.com/2024/01/30/politics/xi-biden-china-us-2024-election?cid=ios_app", "In a Shelby-like act of defiance, the governor is invoking the state’s right to defend itself against what he sees as an invasion. #Abbott made national headlines when he seized the park in #EaglePass this month & shut out U.S. #Border Patrol agents who had long used the terrain as a staging point — action the governor’s supporters saw as a take-charge move, while his detractors viewed it as a dangerous #overreach of #state #power.#federal #Biden #SCOTUS #immigration #NationalGuard #GregAbbott", "#Texas #NationalGuard Humvees carry rifle-toting troops & patrol newly erected gates to the municipal park previously used for family cookouts & Independence Day festivities. Tents, military trucks, heavy equipment & portable toilets dot the edge of a browning fairway. Along the riverbank, Gov #GregAbbott (R) has ordered the state National Guard to deploy coils of #RazorWire, rusting shipping containers & dirt-filled barrels to declare his state’s sovereignty.#state #federal #Biden #immigration", "#Texas #border city on edge as Gov #Abbott dials up battle w/ #BidenA century & a half ago, Confederate Gen Joseph Orville Shelby splashed into the wild waters of the Rio Grande off this border city & fled to Mexico, refusing to surrender to Union soldiers.\u2029Now the park named in his honor (?) has become a front line in a feud between the #state & the #federal govt — a power struggle over who ultimately has the right to control the border….#immigrationhttps://www.washingtonpost.com/nation/2024/01/30/eagle-pass-texas-standoff-border-biden/", "NYTimes: How the Border Crisis Shattered Biden’s Immigration HopesHow the Border Crisis Shattered Biden’s Immigration Hopes https://www.nytimes.com/2024/01/30/us/politics/biden-border-crisis-immigration.html?smid=nytcore-android-share", "Speaking at the White House, Mr Biden added: “I don’t think we need a wider war in the Middle East.” Read More BBC News – US & Canada … https://factline.org/biden-says-he-has-decided-us-response-to-jordan-attack/", "What he really meant: Translating Biden on the border https://my24group.com/what-he-really-meant-translating-biden-on-the-border/ White House He wants support from both sides and he’s not afraid to ask for it.By Alex Keeney and Krystal Campos 01/29/202…", "Biden has been buoyed by positive economic news as fears of a recession have faded. Now he’s eager to stockpile campaign cash to help him promote his record and target Trump in what is expected to be a grueling and expensive election year. Read More PBS NewsHour – The Latest … https://factline.org/biden-heads-to-florida-for-campaign-stops/", "100 miles of the border.If Abbott and other MAGA GOP governors think CBP is failing to adequately control the border, they each have two US Senators and one or more US Representatives they can and should complain to and urge to pass President Biden’s supplemental funding request that would provide the resources needed to manage the flow of migrants at the southern border.The answer is most certainly not to employ the language and tactics that have led to secession and civil war.", "President Biden this morning spoke with the family members of the three US Army reservists from Georgia killed in the drone attack in Jordan and he will be going to the dignified transfer ceremony on Friday, NSC spokesman John Kirby tells reporters on Air Force One.", "Joe Biden reportedly seeking Taylor Swift endorsement to swing next US Presidential Electionhttps://www.nme.com/news/music/joe-biden-reportedly-seeking-taylor-swift-endorsement-to-swing-next-us-presidential-election-3579369?utm_source=rss&utm_medium=rss&utm_campaign=joe-biden-reportedly-seeking-taylor-swift-endorsement-to-swing-next-us-presidential-election#nme", "@sepfeiffer It seems like this was a federal crime, so Biden could pardon him. But he won't.", "Biden says he has decided how to respond to attack in Jordan | CNN Politics https://my24group.com/biden-says-he-has-decided-how-to-respond-to-attack-in-jordan-cnn-politics/ President Joe Biden told reporters Tuesday he has made a decision about the US response to the drone strike that killed th…"]