["Trump’s $50 Million Mystery Debt Looks Like ‘Tax Evasion’ https://www.thedailybeast.com/trumps-dollar50-million-mystery-debt-looks-like-tax-evasion/ #uspol #ChicagoWonder if Alderman Burke had a hand in this?", "The deal had been in the works for months and seemed to be nearing completion in the Senate before it began to fall apart, largely because Republican presidential front-runner Donald Trump doesn’t want it to happen. Read More PBS NewsHour – The Latest … https://factline.org/president-biden-says-hell-shut-the-u-s-mexico-border-if-given-the-ability-what-does-that-mean/", "Trump White House EXPOSED as PILL-MILL in SHOCKING Reporthttps://youtu.be/_DqjNeDH3NM?si=4PtQjfm2_Fz83f1R", "@uspolitics Their absolute obsession with loyalty to Trump above country and everything else never ceases to be sickening.", "Presidential candidate Kennedy Jr commits to halting US advancement toward ... - published 30 Jan 2024 #UnitedStates #News #Trump #Bitcoin #CBDC https://grafa.com/news/presidential-candidate-kennedy-jr-commits-to-halting-us-advancement-toward-cbdc-175278", "You know, if a guy who claims to be a billionaire has bad lawyers, there's a reason for that, and it's not that there are no good lawyers.#Trump", "CNN Host TRIGGERS Republican, Shuts Down MAGA LIES to His Face! - https://youtu.be/L69HHlxWN-k?si=P8gRx6cHuuRb4-Zn #USForces #politics #biden #trump #maga #republican #cnn #dronestrike #drone #jordan #usmilitary #war #military #PonderingPolitics", "Why is this headline in Rolling Stone and not The Onion?https://www.rollingstone.com/politics/politics-features/trumps-secret-plan-expand-presidential-immunity-1234955710/", "Add \"Scab\" to the TFG's rapsheet.\"Donald Trump is a scab.\"https://m.youtube.com/watch?v=HRy67c-nvds:mastodon:", "Retired Republican judge: \"Absolutely damning\" 14th amendment evidence in new bid to bar Trump from #Illinois ballot#Election2024 https://www.salon.com/2024/01/29/retired-judge-absolutely-damning-evidence-in-new-bid-to-bar-from-illinois-ballot/", "<Nim> pretty much the entire Democrat inner circle are either pushing bipartisan queerphobic legislation, quoting Trump, reviving the red scare, or all of the above.", "Charles Littlejohn, the IRS contractor who leaked Trump's tax returns, gets five years, which is longer than some of the sentences handed out to January 6th insurrectionists https://www.axios.com/2024/01/29/trump-taxes-charles-littlejohn-irs-sentencing", "People have been brainwashed to think that trump is somehow invincible when there is plenty of evidence to the contrary.", "“Trump’s candidacy on the Illinois ballot should be decided by the courts, an elections board hearing officer says” https://www.wbez.org/stories/trumps-candidacy-on-the-illinois-ballot-should-be-decided-by-the-courts-hearing-officer-says/e9af3a79-7e96-4429-8bf0-282833888bb2", "@georgetakei Strange, because that was one of the most cringe performance moments I've seen from Trump.", "I think the Biden camp wanted to avoid the mental fit age fight but it seems to really irk Trump. The general public knows biden is old but the media is only now starting to pay closer attention to trumps lapses. The Biden camp is more than happy to have Trump have several more campaigns stops where all he does is ramble about being able to identify a whale.   #Election2024 #Politics #uspol", "It all happened without fuss. Instead of working for a better society collectively we believed we deserved a better individual life. Over time our rights repaced the collective right. It is humankind’s greed that breeds Trumps. Swing the pendulum the other way friends. To beat Trump, we need to know why Americans keep voting for him. Psychologists may have the answer https://www.theguardian.com/commentisfree/2024/jan/29/donald-trump-americans-us-culture-republican?CMP=Share_iOSApp_Other", "Iran and cf MullahsDid Trump sell/show/allow access to intelligence in order to get off of the #fatwa list?Iran, we know it's true. Can this criminal bribe his way out of the fatwa? This is weak. Weak.", "To beat Trump, we need to know why Americans keep voting for him. Psychologists may have the answer | George Monbiot | The GuardianUS culture is an incubator of ‘extrinsic values’. Nobody embodies them like the Republican frontrunnerhttps://www.theguardian.com/commentisfree/2024/jan/29/donald-trump-americans-us-culture-republican", "GOP Senator Reveals the Sick Truth About the Trump-MAGA Border Scam | The New Republichttps://newrepublic.com/article/178530/gop-senator-james-lankford-trump-maga-border-scam", "Daily \"Probabilistic Views\" Summary:281.0 days until polls start to closeOdds with Independent States:Trump: 98.5% (was 99.0% a week ago)Tie: 0.3% (was 0.2% a week ago)Biden: 1.2% (was 0.9% a week ago)Odds with Uniform Swing:Trump: 95.6% (was 95.6% a week ago)Tie: 0.0% (was 0.0% a week ago)Biden: 4.4% (was 4.4% a week ago)This is a nowcast, not a forecast!More info here: https://electiongraphs.com/2024ec/#USPol #Election2024 #Biden #Trump", "@tomiahonen It's insane - I was telling my father about the result of the E. Jean Carroll trial and Trump having to pay an unwieldy amount of money (to put it lightly) and he was like \"it doesn't matter\" and convinced, from the paper he reads, that Trump is on the road to being reelected.I really wish I could have channeled you at that point and told him to fucking celebrate this win. Not the moment for doomism.", "In October 2017, the IRGC & its proxies attacked the KRG held areas in & around Kirkuk Iraq, the center of Iraq's massive oil and gas fields. Reports that #Manafort was in the area. This action was to give #Kurdish controlled fields to Rosneft.Regarding which Trump reportedly held a personal financial interest. Pompeo did nothing. Pompeo's conduct as CIA head was so shocking that I began to examine his past and concluded there was a strong likelihood he had been recruited by the SVR/kgb/putin in Bavaria in late 80s. In any event,Trump allowed control of the oilfield to #Iran & #Russia and I suspect Trump received a cash payment due to his Rosneft interest. If Trump opens his mouth about the Iranian attack, #Democrats must call for a full investigation of Trump- Pompeo & their deal to turn over #Kirkuk. Turn the Iranian focus on Trump & his #Koch-owned bag man #Pompeo. Force the CIA to disclose that they had a mole running the agency & that Trump is, and has been for decades, a Kremlin intel asset. -t.h.", "As much the general public is tired of Joe Biden, I still think the public is even more tired of Donald Trump. #Election2024 #Politics #uspol", "Daily \"Categorization View\" Summary:281.0 days until polls start to closeTrump Best: Trump by 134(Was Trump by 134 a week ago)Expected: Trump by 50(Was Trump by 88 a week ago)Biden Best: Biden by 16(Was Biden by 16 a week ago)Tipping point: Trump ahead by 4.0% in MI(Was Trump ahead by 4.0% in MI a week ago)This is a nowcast, not a forecast!More info here: https://electiongraphs.com/2024ec/#USPol #Election2024 #Biden #Trump", "Last year, the Heritage Foundation published a 920-page document that lays out the conservative organization’s road map for the next Republican president’s first four months in office, which could very well be Donald Trump.https://www.conspirituality.net/episodes/187-project-2025-authoritarian-conspiracy#project2025", "Possible Russian attack on NATO: “This is the only existential threat that we have,” Estonia's General Palm told NYT, noting many NATO militaries remain unprepared to confront Russia. Amid wavering US support under Trump, alliance races to boost defenses.https://euromaidanpress.com/2024/01/29/nyt-russian-attack-on-nato-looms-as-trump-threatens-to-abandon-alliance/", "https://www.thenation.com/article/archive/fani-willis-scandal-charges-against-trump/", "J. Michael Luttig: Retired conservative federal judge urges Supreme Court to disqualify Trump from office | CNN Politics https://my24group.com/j-michael-luttig-retired-conservative-federal-judge-urges-supreme-court-to-disqualify-trump-from-office-cnn-politics/ A former conservative federal appellate judge is urging the Supreme Court to keep Donald Trump off the ballot, a…", "Awwww...... Michigan #GOP turmoil threatens effort to flip state for #Trump | The Hillhttps://thehill.com/homenews/campaign/4435973-michigan-gop-kristina-karamo-joe-biden-donald-trump-2024/", "E. Jean Carroll Speaks For The First Time About Facing Donald Trump At Trial: “He Was Like Nothing, Like An Emperor Without Clothes”#Legal #News #Politics #DonaldTrump #EJeanCarrollhttps://deadline.com/2024/01/e-jean-carroll-trump-in-court-he-was-nothing-1235807931/", "I think Trump will have a stroke before everything is resolved.", "BREAKING: An IRS consultant was sentenced today to the maximum five years in prison for leaking then-President Trump’s tax returns to The New York Times and @ProPublica. https://pressfreedomtracker.us/all-incidents/irs-consultant-charged-with-leaking-tax-returns-to-two-news-outlets/", "@urbanfoxe @DemocracyMattersALot There's always been crazy, but it was never really mainstream till Trump.", "@tomiahonen And unless he goes to jail, he won't even get a job as an animal carcass cleaning assistant.", "@_chris_real Wait, back up to \"it would divide the country\" because we're already well past that point.Trump has already divided this country. For God's sake, he had people on January 6th willing to commit treason and murder to keep him in power. All because his fragile little fee-fees got hurt when he didn't win the election.", "@DeliaChristina it's never good to blame outside actors, but there actually was Russian interference in 2016, and Trump did call on \"Russia\" for help", "More Financial Crimes, more fraud. The adjudicated rapist under court ordered Trustee monitoring moved cash from Chicago operations into his personal account without reporting the income. He did NOT report. This was pay the judgement for defaming the Woman he sexually assaulted. Report that they made entries to make it look like a loan but nothing really to substantiate it.  Even if a loan if it was forgiven he's got to report it as discharge of debt income.If still within the criminal statute of limitations tfg has got a problem and could be facing more criminal liability. It looks like he lied to the Court Monitor. https://www.thedailybeast.com/trumps-throw-tantrum-over-court-monitors-financial-bombshell?source=twitter&via=desktop https://wapo.st/4beNvJB"]