["RFK Jr. says Trump team has ‘reached out’ about being ex-prez’s VP despite denialIndependent presidential candidate Robert F. Kennedy Jr. says Donald Trump’s team has indeed reached out to him about the possibility of joining the Republican front-runner’s ticket — despite attempts from the 77-year-old’s top aides to throw cold water on the possibility.“People from the team have reached out to me,” the 70-year-old Kennedy told NewsNation before shooting down the chance of a Trump-Kennedy ticket.“I would not take that job,” he said. “I’m flattered that President Trump would offer it to me, but it’s not something that I’m interested in.”The Post reported Saturday that Trump’s team had been in touch with RFK Jr. about “premature” VP possibilities when Kennedy launched his 2024 campaign in April.Later that day, Trump’s top campaign aide Chris LaCivita disputed the report and attacked the independent’s policies.#USPol #Politics #News #Trump #RFKJr #VPhttps://www.msn.com/en-us/news/other/rfk-jr-says-trump-team-has-reached-out-about-being-ex-prez-s-vp-despite-denial/ar-BB1huNJc", "@rbreich Ginni Thomas! #Jan6 wild woman and wife of Supreme Court justice. She does seem to have disappeared. Denver Post says, \"...Under its Code of Ethics, Justice Thomas should recuse himself.\" #Colorado #Trump https://www.denverpost.com/2024/01/30/clarence-thomas-recuse-himself-colorado-trump-case-ballot-14th-amendment/", "Has Trump taken this week's cognitive test yet?#TrumpDementia", "Why Sen. Brian Schatz thinks child safety bills can trump the First Amendment | Nilay Patel for The Vergehttps://www.theverge.com/24054658/senator-brian-schatz-congress-kosa-first-amendment-regulation-decoder-interview?utm_source=flipboard&utm_medium=activitypub", "@az I’ve got a family member just like this. So impressionable.", "@jaykuo It would be nice if Republicans could do something beneficial for their country, instead of tit-for-tat retribution crap that barely makes any sense.They are wasting absolutely everyone's time pretending Trump is innocent, and the only way to prove it is by pulling all these stunts.", "@GottaLaff Well, #Trump is the leading Presidential distributor of #Syphilis 😵‍💫", "Pro-Trump network OAN execs may have ‘engaged in criminal activities’ while promoting 2020 election lies, Smartmatic alleges https://www.cnn.com/2024/01/29/business/oan-smartmatic-election-lawsuit/index.html/ #uspol #legal #Jan6", "@GottaLaff This doesn't surprise me. People forget that outside of Chicago and its suburbs, Illinois is basically Nebraska. The third largest city in the United States is what keeps Illinois blue. There will never be a real concern that Illinois will swing for Trump. The down-ballot races, though...", "Air Force One has landed at Palm Beach Int'l Airport for the first time since Inauguration Day 2021. I was on that final Trump flight: https://www.voanews.com/a/usa_us-politics_trump-flies-florida-biden-inaugurated/6200985.html", "Illinois election board dismisses 14th Amendment case against Trump, though an appeal is expected | CNN Politics https://my24group.com/illinois-election-board-dismisses-14th-amendment-case-against-trump-though-an-appeal-is-expected-cnn-politics/ The Illinois State Board of Elections voted Tuesday to dismiss a challenge to former President Donald Trump’s candid…", "It's frustrating that after all that has happened over the last 8 years, many people still need reminding of one simple fact: MAGAts are depraved monsters.Normally, being charitable is a virtue, but there is no virtue in being charitable to MAGAts. They cannot be reasoned with. They don't want your understanding or empathy. They want your total submission or worse.Assume every MAGA is a sociopath, like Hannibal Lector. They'd roast and eat you if Trump told them to.https://www.salon.com/2024/01/30/its-not-that-maga-doesnt-believe-e-jean-carroll--they-just-dont-care-that-abuses-women/", "Trump stays on Illinois' ballot as election board declines to ban him over insurrection amendment https://apnews.com/article/8709a8dbf12f845ed30fce22c9bff469", "Never make the mistake of thinking there's no difference. Not enough, maybe, but it would be as bad as thinking there's no difference between Biden and Trump...", "@IngridAusOL Ich habe keine Angst vor Trump als ich Kind war er schubste mich beiseite in seinem Tower, ich boxte zurück, er lachte😤", "\"Illinois keeps Trump on the ballot\"https://www.dailykos.com/stories/2024/1/30/2220425/-Illinois-keeps-Trump-on-the-ballot#GOP #Trump #14A #insurrectionist #Illinois", "“Three years later, beware dangerous revisionism of Jan. 6”“a sizable share of Americans accept lies about the 2020 election and the insurrection that followed on Jan. 6, 2021.”“The devotion of the GOP base to this alternative history helps explain why Mr. Trump has avoided meaningful accountability, why he is still the front-runner, by far, for the Republican nomination—and how dangerous he could be back in power.”(Editorial from Jan. 5, 2024.)https://wapo.st/42gAQ4Q", "Trump chose 'the stupidest way possible' to try to steal an election: law professor ... Lessig warned that unless Congress enacts some much-needed reforms, the more competent methods still pose a threat to democracy. \"... the most dangerous possibilities involve rogue ... Republican state legislatures — giving themselves final power over electoral outcomes...\"https://www.rawstory.com/how-many-ways-did-trump-try-to-steal-the-election/?u=fbcb7b7cf1ba6174fd59536ae4fd00d05aac9f9b3a914c7891a0ed3accd689d7&utm_source=Iterable&utm_medium=email&utm_campaign=Jan.30.2024_5.33pm", "NH primary results show #Trump has lost a large swath of the GOP - https://boingboing.net/2024/01/30/nh-primary-results-show-trump-has-lost-a-large-swath-of-the-gop.html let's hope....", "Regardless of whether or not he is on ballots and regardless of vote totals, if he loses big or small, he's going to say he was cheated out of it and we will still be mired in his bullshit world.Trump can stay on Illinois 2024 ballot after 14th Amendment challenge, officials say https://abcnews.go.com/Politics/trump-remain-illinois-2024-ballot-after-14th-amendment/story?id=106765313", "The feud between #Abbott & the #Biden admin is heating up just as the presidential #election campaign gets underway. The issue has galvanized #Republicans, some of whom are now questioning the merits of a #bipartisan #border package tied to #Ukraine #aid after #Trump called it “meaningless.” #POTUS Biden has been pushed to take a harsher stance — declaring Fri that he would “shut down” the southern border when illegal crossings surge.#state #federal #immigration #NationalGuard #GregAbbott", "@cosmiclibrarian @Etain18 I see Corbell as a journalist who has successfully established trust with many insiders.Delonge, I think, positioned himself as a media-savvy ally for key intelligence insiders who wanted to disrupt the status quo and get this back on the radar. I think they may have intended to do more from their official positions under a democratic white house, but when Trump won in 2016, some of them went back into hiding and others jumped ship to start TTSA.I largely trust Elizondo, Mellon, and that whole bunch. Maybe I'm naive, but that's my take, for what it's worth.", "I blame Trump.\"Syphilis Is Soaring in the U.S.Cases have risen by 80 percent since 2018, the C.D.C. reported. But chlamydia remains by far the most common sexually transmitted infection\".https://www.nytimes.com/2024/01/30/health/syphilis-cdc.html", "#SCOTUS has ordered #Abbott to allow #Border Patrol agents to remove or cut wire to reach the river & aid #migrants in distress. Abbott’s troops are installing even more wire. 25 #Republican governors recently signed a letter expressing their support for Abbott’s #rebellion, & #Trump is calling on states to join the standoff.#state #federal #Biden #SCOTUS #immigration #EaglePass #NationalGuard #GregAbbott #RazorWire", "The 12K jobs cut by UPS this morning doesn’t have that same “economy is doing great” ring to it does it? Combined that with the videos of brainwashed dems chanting “four more years” and I’m pretty sure Trump is winning the next election.", "Hitler's power grew out from the Weimar Republic in September 1919 and after 20 years of #fascistfeaturecreep WWII fulminates, but a siloed America doesn't hear the explosion until 828 days later when it becomes politically expedient to join the global fight against #totalitarianism Taking a range between #obama 2011 skewering #trump and 2014 Russian and NK cyberwarfare scaffolding trump's 2016 campaign, approximately when do you estimate the world will save the #US from us?#politics", "@GottaLaff if trump loses his case in georgia or the jack smith federal one, i'm wondering if they will revisit thisgranted, if there is enough time. which is why trump uses endless stalling tactics", "“#Trump can remain on #Illinois’ presidential primary ballot, the State Board of Elections voted on Tuesday, dismissing another challenge to the former president's eligibility under Section 3 of the #14thAmendment.8-person, bipartisan board voted unan against lawsuit brought by group of Illinois voters represented by nat watchdog group Free Speech for the People & Illinois elections lawyers.The body said it lacked the authority to decide on the challenge” #legal https://trib.al/6OFJTW8", "@GottaLaff I love Roberta Kaplan tying Habba's letter with Trump's own long-standing false narrative against Judge Kaplan.Habba should face Rule 11 sanctions for this - she can lie (within reason) Fox News or OAN, but not make absurd insinuations to a federal judge, and potentially mislead as to when/how she learned of this supposed conflict she now complains of.", "Pavel: Europe, Ukraine need to prepare for a Trump presidency: https://benborges.xyz/2024/01/30/pavel-europe-ukraine.html", "4/ \"Jury of Trump’s peers has now 2x found him liable for sexual assault, defam & $88 mil in compensatory & pun. damages..No basis to set either verdict aside.While Habba ends letter by char. this as “troubling matter\"..what is actually troubling is both substance & timing of false accusations of impropriety by on part of EJean Carroll’s counsel or the Court..while we wanted to submit our response to Habba’s letter as soon as poss we reserve all rts, incl but not lmtd to rt to seek sanctions..\"", "via Lawrence Tribe: \"This masterful amici brief is far more than an “us too” document. It is aimed at the very heart of the Court as currently composed. Its arguments, thanks largely to @judgeluttig, include some that no other brief of the multitude filed in the case makes.\" 'Retired conservative federal judge urges Supreme Court to disqualify Trump from office' – CNNOral arguments set for February 8#SCOTUS #Section3 #14thAmendment https://www.cnn.com/2024/01/29/politics/luttig-conway-supreme-court-trump-insurrection/index.html", "3/ \"From the very start of the recently concluded trial, Trump & Habba have pushed false narrative of judicial bias so that they could characterize any jury verdict against Trump as product of corrupt system. .. While that strategy has now moved into its post-verdict phase, it is now time for Defendant’s false and vexatious claims of bias or impropriety to stop. “Litigants cannot be permitted to sit silently on recusal grounds and then to advance them only after they have lost the case.”", "Los Angeles political class continues its comic book villain-level corruption as former city attorney and known grifter Mike Feuer prepares to fail upward.From the Debaser:\"Mayor of LA Endorses Mike Feuer\"\"Voting in California is about to begin for the March 5 elections, and Feuer hopes to become the next Adam Schiff, who himself is running for Senate off his #Resistance brand. Schiff came up as a federal prosecutor in the same office that failed to charge Feuer....\"Now Feuer wants to be the leader of the Anything But Trump Movement, a hysterical collective of corporate authoritarians and culture war addicts who haven’t bothered to look in the mirror for decades.\"https://debaser.substack.com/p/mayor-of-la-endorses-mike-feuer", "Peace abroad, insurrection here.  🤨\"Trump Nabs Nobel Peace Prize Nomination From GOP Rep Citing ‘Historic’ Abraham Accords\"https://themessenger.com/politics/trump-nabs-nobel-peace-prize-nomination-from-gop-rep-citing-historic-abraham-accords\"Trump has previously been nominated for the Nobel Peace Prize three times\"#GOP #Trump #insurrectionist #Nobel", "Biden has been buoyed by positive economic news as fears of a recession have faded. Now he’s eager to stockpile campaign cash to help him promote his record and target Trump in what is expected to be a grueling and expensive election year. Read More PBS NewsHour – The Latest … https://factline.org/biden-heads-to-florida-for-campaign-stops/", "@Rana @tagesschau Wenn es ein unwichtiges Thema wäre, würde ich 🤣 🤣 🤣 , aber ich denke dann an die schlimmsten Möglichkeiten: #Trump an der Regierung und dann den Chip aus Massenherstellung und ohne Wissen eingesetzt... Medizinische Experimente im großen Stil haben uns die #Nazis doch vorgemacht...Absolut dagegen... Braucht kein gesunder Mensch.", "E Jean's lawyers are simply awesome.👀 Via Klasfeld:News#EJeanCarroll's lead attorney threatened SANCTIONS against Trump lawyer Alina #Habba over her \"utterly baseless\" claim that a federal judge had an undisclosed conflict of interest. #legal #TrumpHabba's conflict claim is based entirely on a single-anon source story in NY Post.Carroll's lawyer ques how the tabloid came to publish it & if the supposed partner at Paul Weiss — the firm where she and the judge both worked— \"even exists.\"", "BigDataLove.com #AI »Why Sen. Brian Schatz thinks child safety bills should trump the First Amendment« https://www.theverge.com/24054658/senator-brian-schatz-congress-kosa-first-amendment-regulation-decoder-interview #BigDataLove #BigData #ML #NLP", "Meet one of the extremist \"influencers\" behind the Big Lie that has made more and more Republicans comfortable with insurrection. https://www.motherjones.com/politics/2024/01/brandon-straka-profile-january-6-hairstylist-gop-trump/"]